{
  "2025-2-24": [
    [
      "2025-02-24 11:10AM",
      "Penn schools scrubbed their DEI websites. Here’s what’s left."
    ],
    [
      "2025-02-24 11:34AM",
      [
        "Penn schools scrubbed their DEI websites. Here’s what’s left.",
        "Faculty and student groups call on Penn to protect undocumented, international students",
        "Interim SAS dean calls graduate admissions cuts a ‘cost-saving measure,’ cites NIH funding cap",
        "Mritika Senthil | NIH funding cuts aren’t the crisis Penn claims",
        "DP Daybreak | Where DEI stands at Penn",
        "Penn schools scrubbed their DEI websites. Here’s what’s left.",
        "Faculty and student groups call on Penn to protect undocumented, international students",
        "DP Daybreak | Where DEI stands at Penn",
        "Quaker Nation | No Ivy playoffs for Penn men's basketball",
        "Black History Month at Penn",
        "Submit your tip confidentially and securely to the DP",
        "Penn faculty express concern over lack of institutional support, funding cuts for DEI research",
        "DP Daybreak | Where DEI stands at Penn",
        "Four Penn professors awarded 2025 Sloan Research Fellowships",
        "Laura Perna reappointed as Penn’s vice provost for faculty",
        "Penn’s Medical Emergency Response Team hosts third annual five-minute CPR training event",
        "Penn to reduce graduate admissions, rescind acceptances amid federal research funding cuts",
        "DP Daybreak | City Councilmember condemns Trump",
        "Jamie Gauthier condemns Trump for ‘Long live the king!’ post in Phila. City Council resolution",
        "Penn professor Kathryn Hellerstein discusses Yiddish poetry translation at Kelly Writers House event",
        "Hurrah, hurrah: Penn men’s basketball snaps five-game losing streak with win over Dartmouth",
        "Quaker Nation | No Ivy playoffs for Penn men's basketball",
        "Seven goals from Brandt not enough as No. 12 Penn women’s lacrosse falls to No. 10 Johns Hopkins",
        "Crain | Penn men’s lacrosse is back on the right track",
        "Penn men’s basketball eliminated from Ivy League tournament contention following 79-78 loss to Harvard",
        "Mia Vesely | Black Penn is not a monolith",
        "Mritika Senthil | NIH funding cuts aren’t the crisis Penn claims",
        "Jason Zhao | Birthright citizenship makes us, U.S.",
        "Simar Soni | Situationships suck: Bring back the 2000s",
        "Diya Choksey | The Penn ‘Hunger Games’: May social capital be ever in your favor",
        "Tiyya Geiger and Piper Slinka-Petka | Must be LOVE on the brain"
      ]
    ]
  ]
}